#include "station.h"

const double price_per_km = 4; // in rubles

const unordered_map<string, Station> stations {
    {"Москва", {0, ""}},
    // Воронеж direction
    {"Рязань лучше не надо", {480, "Москва"}},
    {"Мичуринск", {1200, "Рязань лучше не надо"}},
    {"Грязи", {1570, "Мичуринск"}},
    {"Придача", {1950, "Грязи"}},
    {"Воронеж", {2000, "Придача"}},
    // Екатеринбург direction
    {"Ярославль", {250, "Москва"}},
    {"Кострома", {280, "Ярославль"}},
    {"Галич", {560, "Кострома"}},
    {"Киров", {700, "Галич"}},
    {"Пермь", {990, "Киров"}},
    {"Екатеринбург", {1520, "Пермь"}},
};
